Ran Plan for project: `sharedservices-prod` dir: `accounts/backstage-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate_validation.cert_validation_complete will be created
+ resource "aws_acm_certificate_validation" "cert_validation_complete" {
      + certificate_arn         = "arn:aws:acm:us-east-2:825765422855:certificate/20392fd3-e0a5-4c7d-ab03-b9fcb1afc1dd"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_ecs_service.backstage will be created
+ resource "aws_ecs_service" "backstage" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:us-east-2:825765422855:cluster/backstage-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "backstage-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "DeployedBy" = "Terraform"
        }
      + task_definition                    = "arn:aws:ecs:us-east-2:825765422855:task-definition/backstage-task:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "backstage"
          + container_port   = 7007
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:825765422855:targetgroup/backstage-tg/352232bb606e0835"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0d60911e1d971624d",
            ]
          + subnets          = [
              + "subnet-06ea04da1d57590d6",
              + "subnet-0c2ce4fe6da96632e",
            ]
        }
    }

  # aws_lb_listener.frontend_https will be created
+ resource "aws_lb_listener" "frontend_https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:us-east-2:825765422855:certificate/20392fd3-e0a5-4c7d-ab03-b9fcb1afc1dd"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:us-east-2:825765422855:loadbalancer/app/backstage-alb/da6d56c961fa9ce6"
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-2016-08"
      + tags_all                                                              = {
          + "DeployedBy" = "Terraform"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = 1
          + type  = "authenticate-cognito"

          + authenticate_cognito {
              + on_unauthenticated_request = "authenticate"
              + scope                      = (known after apply)
              + session_cookie_name        = (known after apply)
              + session_timeout            = (known after apply)
              + user_pool_arn              = "arn:aws:cognito-idp:us-east-2:825765422855:userpool/us-east-2_QCbD58Fhg"
              + user_pool_client_id        = "4nq6k8eh3i36phhtjs2s5sto38"
              + user_pool_domain           = "backstage-auth-feedutopia"
            }
        }
      + default_action {
          + order            = 2
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:825765422855:targetgroup/backstage-tg/352232bb606e0835"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_route53_record.backstage_domain must be replaced
-/+ resource "aws_route53_record" "backstage_domain" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "backstage.feedutopia.com" -> (known after apply)
      ~ id                               = "Z04892922X52J3P3QQIBG_backstage.feedutopia.com_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "backstage.feedutopia.com"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z04892922X52J3P3QQIBG" -> "Z0783926A0QGXSW1QXG0" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.cert_validation must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_f5adea8b774ce81f7b1c55a438cd518a.backstage.feedutopia.com" -> (known after apply)
      ~ id                               = "Z04892922X52J3P3QQIBG__f5adea8b774ce81f7b1c55a438cd518a.backstage.feedutopia.com._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_f5adea8b774ce81f7b1c55a438cd518a.backstage.feedutopia.com"
      ~ zone_id                          = "Z04892922X52J3P3QQIBG" -> "Z0783926A0QGXSW1QXG0" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_route53_zone.feedutopia will be destroyed
  # (because aws_route53_zone.feedutopia is not in configuration)
- resource "aws_route53_zone" "feedutopia" {
      - arn                 = "arn:aws:route53:::hostedzone/Z04892922X52J3P3QQIBG" -> null
      - comment             = "Managed by Terraform" -> null
      - force_destroy       = false -> null
      - id                  = "Z04892922X52J3P3QQIBG" -> null
      - name                = "feedutopia.com" -> null
      - name_servers        = [
          - "ns-1348.awsdns-40.org",
          - "ns-1617.awsdns-10.co.uk",
          - "ns-251.awsdns-31.com",
          - "ns-573.awsdns-07.net",
        ] -> null
      - primary_name_server = "ns-573.awsdns-07.net" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "DeployedBy" = "Terraform"
        } -> null
      - zone_id             = "Z04892922X52J3P3QQIBG" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 0 to change, 3 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fbackstage-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 5 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```